<a href="https://colab.research.google.com/github/Ganesh9100/machine_learning/blob/master/pandas_part1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
!git clone https://github.com/justmarkham/pandas-videos.git

Cloning into 'pandas-videos'...
remote: Enumerating objects: 6, done.
remote: Counting objects: 100% (6/6), done.
remote: Compressing objects: 100% (5/5), done.
remote: Total 318 (delta 1), reused 4 (delta 1), pack-reused 312
Receiving objects: 100% (318/318), 1.71 MiB | 15.45 MiB/s, done.
Resolving deltas: 100% (189/189), done.

In [0]:
import pandas as pd
df=pd.read_table("/content/pandas-videos/data/chipotle.tsv")# default is tab seperated so read_table

In [3]:
df.head()

   order_id  ...  item_price
0         1  ...      $2.39
1         1  ...      $3.39
2         1  ...      $3.39
3         1  ...      $2.39
4         2  ...     $16.98

[5 rows x 5 columns]

In [0]:
# if it is | seperated give the second arg , sep="|"

In [0]:
mv=pd.read_table("https://bit.ly/movieusers")

In [6]:
mv.head()

   1|24|M|technician|85711
0       2|53|F|other|94043
1      3|23|M|writer|32067
2  4|24|M|technician|43537
3       5|33|F|other|15213
4   6|42|M|executive|98101

In [0]:
# here above it is | speerated so

In [0]:
mv=pd.read_table("https://bit.ly/movieusers",sep='|')

In [9]:
mv.head()

   1  24  M  technician  85711
0  2  53  F       other  94043
1  3  23  M      writer  32067
2  4  24  M  technician  43537
3  5  33  F       other  15213
4  6  42  M   executive  98101

In [0]:
# but the first row is taken as header , since this file has no header give it as non

In [11]:
mv=pd.read_table("https://bit.ly/movieusers",sep='|',header=None)
mv.head()

   0   1  2           3      4
0  1  24  M  technician  85711
1  2  53  F       other  94043
2  3  23  M      writer  32067
3  4  24  M  technician  43537
4  5  33  F       other  15213

In [12]:
 # so just filling up the header

 usl=["id","age","gender","role","zip_code"]
 #to pass this , use the "names"

 mv=pd.read_table("https://bit.ly/movieusers",sep='|',header=None,names=usl)
 mv.head()

   id  age gender        role zip_code
0   1   24      M  technician    85711
1   2   53      F       other    94043
2   3   23      M      writer    32067
3   4   24      M  technician    43537
4   5   33      F       other    15213

In [16]:
ufo=pd.read_table("https://bit.ly/uforeports",sep=',')
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [0]:
# NOTE READ_CSV IS BY DEFAULT TAKE SEP = ','
#       READ_TABLE BY DEFAULT TAKE SEP='TAB'

In [18]:
ufo['City']

0                      Ithaca
1                 Willingboro
2                     Holyoke
3                     Abilene
4        New York Worlds Fair
                 ...
18236              Grant Park
18237             Spirit Lake
18238             Eagle River
18239             Eagle River
18240                    Ybor
Name: City, Length: 18241, dtype: object

In [19]:
type(ufo['City'])

pandas.core.series.Series

In [20]:
#or 
ufo.City

0                      Ithaca
1                 Willingboro
2                     Holyoke
3                     Abilene
4        New York Worlds Fair
                 ...
18236              Grant Park
18237             Spirit Lake
18238             Eagle River
18239             Eagle River
18240                    Ybor
Name: City, Length: 18241, dtype: object

In [21]:
# when you see the column Colour Reported there is as space 
ufo.Colors Reported

SyntaxError: ignored

In [23]:
# this will throw an erroor 
# so 
ufo['Colors Reported'] # this wil work in case of header has some space

0        NaN
1        NaN
2        NaN
3        NaN
4        NaN
        ...
18236    NaN
18237    NaN
18238    NaN
18239    RED
18240    NaN
Name: Colors Reported, Length: 18241, dtype: object

In [24]:
ufo.shape

(18241, 5)

In [0]:
# so this . will take it the column header as attribute 
# if i have the column name as shape 
# if i used to call ufo.shape 
# it will return like this bcz this case wont work as there is a bil in function shape

In [0]:
# RECOMENDED UFO['column header']

In [29]:
ufo['City'] +"       " + ufo['State']

0                      Ithaca       NY
1                 Willingboro       NJ
2                     Holyoke       CO
3                     Abilene       KS
4        New York Worlds Fair       NY
                     ...
18236              Grant Park       IL
18237             Spirit Lake       IA
18238             Eagle River       WI
18239             Eagle River       WI
18240                    Ybor       FL
Length: 18241, dtype: object

In [0]:
ufo['new_header']=ufo['City'] +"," + ufo['State']

In [31]:
ufo.head()

                   City  ...               new_header
0                Ithaca  ...                Ithaca,NY
1           Willingboro  ...           Willingboro,NJ
2               Holyoke  ...               Holyoke,CO
3               Abilene  ...               Abilene,KS
4  New York Worlds Fair  ...  New York Worlds Fair,NY

[5 rows x 6 columns]

In [0]:
movies=pd.read_csv("https://bit.ly/imdbratings")

In [33]:
movies.head()

   star_rating  ...                                        actors_list
0          9.3  ...  [u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt...
1          9.2  ...    [u'Marlon Brando', u'Al Pacino', u'James Caan']
2          9.1  ...  [u'Al Pacino', u'Robert De Niro', u'Robert Duv...
3          9.0  ...  [u'Christian Bale', u'Heath Ledger', u'Aaron E...
4          8.9  ...  [u'John Travolta', u'Uma Thurman', u'Samuel L....

[5 rows x 6 columns]

In [34]:
movies.describe()# this is the discriptive statictics

       star_rating    duration
count   979.000000  979.000000
mean      7.889785  120.979571
std       0.336069   26.218010
min       7.400000   64.000000
25%       7.600000  102.000000
50%       7.800000  117.000000
75%       8.100000  134.000000
max       9.300000  242.000000

In [35]:
movies.dtypes

star_rating       float64
title              object
content_rating     object
genre              object
duration            int64
actors_list        object
dtype: object

In [36]:
movies.shape

(979, 6)

In [0]:
# remeber attributes wont have parenthesis 
# only menthos wil have eg head()

# trick and tip 

#   method - actions 
#  attributes - who u are

In [43]:
movies.describe(include=['object'])# optional parameter this iwll 
# disp only the object type

                                  title  ...                                        actors_list
count                               979  ...                                                979
unique                              975  ...                                                969
top     The Girl with the Dragon Tattoo  ...  [u'Daniel Radcliffe', u'Emma Watson', u'Rupert...
freq                                  2  ...                                                  6

[4 rows x 4 columns]

**Renaming**

In [44]:
ufoo=pd.read_csv("https://bit.ly/uforeports")
ufoo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [45]:
ufoo.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time'], dtype='object')

In [46]:
ufoo.rename(columns={'Colors Reported':'colors_reported','Shape Reported':'shape_reported'})

                       City colors_reported  ... State              Time
0                    Ithaca             NaN  ...    NY    6/1/1930 22:00
1               Willingboro             NaN  ...    NJ   6/30/1930 20:00
2                   Holyoke             NaN  ...    CO   2/15/1931 14:00
3                   Abilene             NaN  ...    KS    6/1/1931 13:00
4      New York Worlds Fair             NaN  ...    NY   4/18/1933 19:00
...                     ...             ...  ...   ...               ...
18236            Grant Park             NaN  ...    IL  12/31/2000 23:00
18237           Spirit Lake             NaN  ...    IA  12/31/2000 23:00
18238           Eagle River             NaN  ...    WI  12/31/2000 23:45
18239           Eagle River             RED  ...    WI  12/31/2000 23:45
18240                  Ybor             NaN  ...    FL  12/31/2000 23:59

[18241 rows x 5 columns]

In [47]:
#or simple method that overwrited the existeing column in order 

ufoo.columns=['city','col_rep','shape_rep']

ValueError: ignored

In [0]:
#there is an error we ahve to give 5 elements 
ufoo.columns=['city','col_rep','shape_rep','state','time']

In [49]:
ufoo.head()

                   city col_rep shape_rep state             time
0                Ithaca     NaN  TRIANGLE    NY   6/1/1930 22:00
1           Willingboro     NaN     OTHER    NJ  6/30/1930 20:00
2               Holyoke     NaN      OVAL    CO  2/15/1931 14:00
3               Abilene     NaN      DISK    KS   6/1/1931 13:00
4  New York Worlds Fair     NaN     LIGHT    NY  4/18/1933 19:00

In [0]:
#but what if we have 100 columns

In [51]:
ufoo.columns

Index(['city', 'col_rep', 'shape_rep', 'state', 'time'], dtype='object')

In [52]:
ufoo.columns.str.replace('_',' ')

Index(['city', 'col rep', 'shape rep', 'state', 'time'], dtype='object')

In [53]:
ufoo.columns.str.replace(' ','__')

Index(['city', 'col_rep', 'shape_rep', 'state', 'time'], dtype='object')

**REMOVING COLUMNS**

In [54]:
ufo.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time',
       'new_header'],
      dtype='object')

In [55]:
ufo.head()

                   City  ...               new_header
0                Ithaca  ...                Ithaca,NY
1           Willingboro  ...           Willingboro,NJ
2               Holyoke  ...               Holyoke,CO
3               Abilene  ...               Abilene,KS
4  New York Worlds Fair  ...  New York Worlds Fair,NY

[5 rows x 6 columns]

In [0]:
ufo.drop('Colors Reported',axis=1,inplace=True)

In [57]:
ufo.head()

                   City  ...               new_header
0                Ithaca  ...                Ithaca,NY
1           Willingboro  ...           Willingboro,NJ
2               Holyoke  ...               Holyoke,CO
3               Abilene  ...               Abilene,KS
4  New York Worlds Fair  ...  New York Worlds Fair,NY

[5 rows x 5 columns]

In [58]:
ufo.drop('Colors Reported','State','Time',axis=1,inplace=True)

TypeError: ignored

In [0]:
# if u want to drop multiple column u can use list 

li=['State','Time']

ufo.drop(li,axis=1,inplace=True)  # axis = 0 , 1  row , column

In [62]:
ufo.head()

                   City Shape Reported               new_header
0                Ithaca       TRIANGLE                Ithaca,NY
1           Willingboro          OTHER           Willingboro,NJ
2               Holyoke           OVAL               Holyoke,CO
3               Abilene           DISK               Abilene,KS
4  New York Worlds Fair          LIGHT  New York Worlds Fair,NY

In [0]:
# to drop rows 

ufo.drop([0,1],axis=0,inplace=True)# dropping 2 rows

In [64]:
ufo.head()

                   City Shape Reported               new_header
2               Holyoke           OVAL               Holyoke,CO
3               Abilene           DISK               Abilene,KS
4  New York Worlds Fair          LIGHT  New York Worlds Fair,NY
5           Valley City           DISK           Valley City,ND
6           Crater Lake         CIRCLE           Crater Lake,CA

In [0]:
ufo.reset_index(inplace=True)# to reset the index

In [71]:
ufo.head()

   index                  City Shape Reported               new_header
0      2               Holyoke           OVAL               Holyoke,CO
1      3               Abilene           DISK               Abilene,KS
2      4  New York Worlds Fair          LIGHT  New York Worlds Fair,NY
3      5           Valley City           DISK           Valley City,ND
4      6           Crater Lake         CIRCLE           Crater Lake,CA

In [72]:
ufo.shape

(18239, 4)

In [0]:
ufo.drop('index',axis=1,inplace=True)

In [74]:
ufo.head()

                   City Shape Reported               new_header
0               Holyoke           OVAL               Holyoke,CO
1               Abilene           DISK               Abilene,KS
2  New York Worlds Fair          LIGHT  New York Worlds Fair,NY
3           Valley City           DISK           Valley City,ND
4           Crater Lake         CIRCLE           Crater Lake,CA

In [77]:
ufo.sort_values('City',ascending=False)# this wont affect the orginal ufo unless i give inplace -= True

                                      City  ...                              new_header
5999                   south of the border  ...                  south of the border,NC
1558                         on plane wing  ...                        on plane wing,NY
12452  observer enroute on MN hwy 61 north  ...  observer enroute on MN hwy 61 north,MN
6784                             not shure  ...                            not shure,ME
1436                                  none  ...                                 none,MI
...                                    ...  ...                                     ...
12439                                  NaN  ...                                     NaN
15765                                  NaN  ...                                     NaN
15810                                  NaN  ...                                     NaN
16052                                  NaN  ...                                     NaN
16606                                  NaN  ...                                     NaN

[18239 rows x 3 columns]

In [78]:
movies.head()

   star_rating  ...                                        actors_list
0          9.3  ...  [u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt...
1          9.2  ...    [u'Marlon Brando', u'Al Pacino', u'James Caan']
2          9.1  ...  [u'Al Pacino', u'Robert De Niro', u'Robert Duv...
3          9.0  ...  [u'Christian Bale', u'Heath Ledger', u'Aaron E...
4          8.9  ...  [u'John Travolta', u'Uma Thurman', u'Samuel L....

[5 rows x 6 columns]

In [81]:
movies.shape

(979, 6)

In [0]:
ll=movies['duration']>=200

In [106]:
movies[ll]

     star_rating  ... longg
2            9.1  ...  True
7            8.9  ...  True
17           8.7  ...  True
78           8.4  ...  True
85           8.4  ...  True
142          8.3  ...  True
157          8.2  ...  True
204          8.1  ...  True
445          7.9  ...  True
476          7.8  ...  True
630          7.7  ...  True
767          7.6  ...  True

[12 rows x 7 columns]

In [107]:
movies

     star_rating  ...  longg
0            9.3  ...  False
1            9.2  ...  False
2            9.1  ...   True
3            9.0  ...  False
4            8.9  ...  False
..           ...  ...    ...
974          7.4  ...  False
975          7.4  ...  False
976          7.4  ...  False
977          7.4  ...  False
978          7.4  ...  False

[979 rows x 7 columns]

In [118]:
movies[movies.star_rating >=9  ]

   star_rating  ...  longg
0          9.3  ...  False
1          9.2  ...  False
2          9.1  ...   True
3          9.0  ...  False

[4 rows x 7 columns]

In [117]:
movies[movies.star_rating >=9  ]['title']

0    The Shawshank Redemption
1               The Godfather
2      The Godfather: Part II
3             The Dark Knight
Name: title, dtype: object

In [119]:
movies.head()

   star_rating  ...  longg
0          9.3  ...  False
1          9.2  ...  False
2          9.1  ...   True
3          9.0  ...  False
4          8.9  ...  False

[5 rows x 7 columns]

In [0]:
movies.drop('longg',axis=1,inplace=True)

In [121]:
movies.head()

   star_rating  ...                                        actors_list
0          9.3  ...  [u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt...
1          9.2  ...    [u'Marlon Brando', u'Al Pacino', u'James Caan']
2          9.1  ...  [u'Al Pacino', u'Robert De Niro', u'Robert Duv...
3          9.0  ...  [u'Christian Bale', u'Heath Ledger', u'Aaron E...
4          8.9  ...  [u'John Travolta', u'Uma Thurman', u'Samuel L....

[5 rows x 6 columns]

In [0]:
movies.drop('actors_list',axis=1,inplace=True)

In [123]:
movies.head()

   star_rating                     title content_rating   genre  duration
0          9.3  The Shawshank Redemption              R   Crime       142
1          9.2             The Godfather              R   Crime       175
2          9.1    The Godfather: Part II              R   Crime       200
3          9.0           The Dark Knight          PG-13  Action       152
4          8.9              Pulp Fiction              R   Crime       154

In [124]:
movies.shape

(979, 5)

In [0]:
gg=['Action','Drama']

In [137]:
movies[(movies.star_rating >=9) & (movies.genre =='Action')]

   star_rating            title content_rating   genre  duration
3          9.0  The Dark Knight          PG-13  Action       152

**TIPS**

In [138]:
ufoo=pd.read_csv("https://bit.ly/uforeports",nrows=3,)
ufoo.head()

          City  Colors Reported Shape Reported State             Time
0       Ithaca              NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro              NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke              NaN           OVAL    CO  2/15/1931 14:00

In [141]:
for index,row in ufoo.iterrows():
  print(index,row.City,row.State)

0 Ithaca NY
1 Willingboro NJ
2 Holyoke CO

**to drop all non numeric columns ie object tyoe**

In [0]:
drinks=pd.read_csv("/content/pandas-videos/data/drinks.csv")

In [144]:
drinks.dtypes

country                          object
beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object